In [1]:
# Pandas Data Frame Topic 2

In [2]:
import pandas as pd
import numpy as np

In [6]:
A1 = pd.Series(['Karachi','Islamabad','Lahore','Quetta','Sindh'])
A2 = pd.Series(['Apple','Orange','Mango','Watermelon','Banana'])

dict = {'City':A1, 'Fruits':A2}

Fruits = pd.DataFrame(dict)

print(Fruits)

        City      Fruits
0    Karachi       Apple
1  Islamabad      Orange
2     Lahore       Mango
3     Quetta  Watermelon
4      Sindh      Banana

In [15]:
test = pd.DataFrame(np.random.randn(5,4), index = ['R1','R2','R3','R4','R5'], columns = ['C1','C2','C3','C4'])
print(test)

          C1        C2        C3        C4
R1 -0.273362 -1.056581 -0.550585 -0.742045
R2  1.008694 -0.929174 -0.921661 -0.695130
R3 -0.384681 -0.260424 -0.276435 -0.633594
R4 -1.066664  0.116801  0.752012 -0.257914
R5  0.892234 -0.785535 -1.612892  1.657390

In [16]:
Dict = {'Country':['Pakistan','Dubai','Turkey','India','China'],'Year':[2015,2016,2017,2018,2022],'Population':['10M','1M','3M','4.4M','9M']}

In [21]:
DF2 = pd.DataFrame(Dict, index=['R1','R2','R3','R4','R5'], columns = ['Population','Year','Country'] )
print(DF2)

   Population  Year   Country
R1        10M  2015  Pakistan
R2         1M  2016     Dubai
R3         3M  2017    Turkey
R4       4.4M  2018     India
R5         9M  2022     China

In [19]:
DF2.head()

    Country  Year Population
0  Pakistan  2015        10M
1     Dubai  2016         1M
2    Turkey  2017         3M
3     India  2018       4.4M
4     China  2022         9M

In [20]:
display(DF2)

    Country  Year Population
0  Pakistan  2015        10M
1     Dubai  2016         1M
2    Turkey  2017         3M
3     India  2018       4.4M
4     China  2022         9M

In [23]:
Dict = {'Country':['Pakistan','Dubai','Turkey','India','China'],'Year':[2015,2016,2017,2018,2022],'Population':['10M','1M','3M','4.4M','9M']}

DF3 = pd.DataFrame(Dict , columns = ['Country','State','Population','Earning'])

display(DF3)

    Country State Population Earning
0  Pakistan   NaN        10M     NaN
1     Dubai   NaN         1M     NaN
2    Turkey   NaN         3M     NaN
3     India   NaN       4.4M     NaN
4     China   NaN         9M     NaN

In [37]:
L = len(DF3)
val = np.arange(5)
val
DF3['Earning'] = val
DF3

    Country State Population  Earning
0  Pakistan   NaN        10M        0
1     Dubai   NaN         1M        1
2    Turkey   NaN         3M        2
3     India   NaN       4.4M        3
4     China   NaN         9M        4

In [39]:
DF3['Earning'] = 100
DF3

    Country State Population  Earning
0  Pakistan   NaN        10M      100
1     Dubai   NaN         1M      100
2    Turkey   NaN         3M      100
3     India   NaN       4.4M      100
4     China   NaN         9M      100

In [41]:
DF3['State'] = ['Karachi','Abu Dabi','Istambul','Bambay','Japan']
DF3

    Country     State Population  Earning
0  Pakistan   Karachi        10M      100
1     Dubai  Abu Dabi         1M      100
2    Turkey  Istambul         3M      100
3     India    Bambay       4.4M      100
4     China     Japan         9M      100